0-PropostaDeDesafio-TituloDoDesafioTecnologico/html/0-DesafioTecnologico-0-Master.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt" xml:lang="pt">
<head>
<!-- 2023-12-23 sáb 20:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="André D. Bueno" />
<meta name="description" content="Apresenta um modelo de desafio tecnológico a ser desenvolvido nas disciplinas de modelagem computacional e/ou no TCC" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd128ea3">1. Instituição</a></li>
<li><a href="#org5cd8d2a">2. Descrição da Proposta</a></li>
<li><a href="#org0e6e718">3. Título da proposta</a>
<ul>
<li><a href="#org85254c8">3.1. Título: titulo&#x2026;</a></li>
</ul>
</li>
<li><a href="#org05061b6">4. Convocação</a></li>
<li><a href="#orgfe633fe">5. Atendimento obrigação?</a></li>
<li><a href="#org3c6838c">6. Área, tema e sub-tema</a>
<ul>
<li><a href="#org9a81791">6.1. Título da área do conhecimento.</a></li>
<li><a href="#org8b4acdd">6.2. Título do tema específico.</a></li>
<li><a href="#org3e9f16d">6.3. Título do sub-tema.</a></li>
</ul>
</li>
<li><a href="#orgabc8ad1">7. Descrição do desafio tecnológico</a></li>
<li><a href="#org112d553">8. Objetivo geral</a></li>
<li><a href="#org17cc12c">9. Solução esperada - Tipo</a></li>
<li><a href="#orgfe9d4c0">10. Solução esperada - Descrição</a></li>
<li><a href="#org9697ee7">11. TRL pretendido</a></li>
<li><a href="#orgf45aaaf">12. CRL pretendido</a></li>
<li><a href="#org8ef3272">13. Informações básicas complementares</a></li>
<li><a href="#org259679e">14. Prazo máximo para desenvolvimento da solução</a></li>
<li><a href="#org7bd6e0e">15. Bibliografia</a></li>
</ul>
</div>
</div>
<p>
+TITLE: Desafio Tecnológico
</p>

<div id="outline-container-orgd128ea3" class="outline-2">
<h2 id="orgd128ea3"><span class="section-number-2">1.</span> Instituição</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>UNIVERSIDADE ESTADUAL DO NORTE FLUMINENSE</li>
<li>CENTRO DE CIÊNCIA E TECNOLOGIA</li>
<li>LABORATÓRIO DE ENGENHARIA E EXPLORAÇÃO DE PETRÓLEO</li>
<li>Desafio Tecnológico
<ul class="org-ul">
<li>Título do Desafio</li>
</ul></li>
<li>AUTORES
<ul class="org-ul">
<li>Prof. nome do professor ou professores</li>
<li>(nome empresas/engenheiros)</li>
</ul></li>
<li>MACAÉ - RJ</li>
</ul>
</div>
</div>

<div id="outline-container-org5cd8d2a" class="outline-2">
<h2 id="org5cd8d2a"><span class="section-number-2">2.</span> Descrição da Proposta</h2>
<div class="outline-text-2" id="text-2">
<p>
Apresenta-se aqui a proposta de desenvolvimento de um projeto de 
engenharia que visa &#x2026;
</p>
</div>
</div>

<div id="outline-container-org0e6e718" class="outline-2">
<h2 id="org0e6e718"><span class="section-number-2">3.</span> Título da proposta</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org85254c8" class="outline-3">
<h3 id="org85254c8"><span class="section-number-3">3.1.</span> Título: titulo&#x2026;</h3>
</div>
</div>

<div id="outline-container-org05061b6" class="outline-2">
<h2 id="org05061b6"><span class="section-number-2">4.</span> Convocação</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Projeto da UENF</li>
<li class="off"><code>[&#xa0;]</code> Projeto do CCT</li>
<li class="off"><code>[&#xa0;]</code> Projeto do LENEP :   nome do professor</li>
<li class="off"><code>[&#xa0;]</code> Projeto de extenção: nome da empresa de engenharia</li>
</ul>
</div>
</div>
<div id="outline-container-orgfe633fe" class="outline-2">
<h2 id="orgfe633fe"><span class="section-number-2">5.</span> Atendimento obrigação?</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> sim - anp.</li>
<li class="off"><code>[&#xa0;]</code> sim disciplinas programação: Introdução ao Projeto de Engenharia, Programação Orientada a Objeto em C++ e Projeto de Software Aplicado à Engenharia (antiga programação prática).</li>
<li class="off"><code>[&#xa0;]</code> sim - TCC do curso de engenharia de petróleo.</li>
<li class="off"><code>[&#xa0;]</code> não.</li>
</ul>
</div>
</div>

<div id="outline-container-org3c6838c" class="outline-2">
<h2 id="org3c6838c"><span class="section-number-2">6.</span> Área, tema e sub-tema</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org9a81791" class="outline-3">
<h3 id="org9a81791"><span class="section-number-3">6.1.</span> Título da área do conhecimento.</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>Dica: Ver áreas do conhecimento no site do CNPq ou no diretório MaterialAuxiliar, arquivo TabelaAreasConhecimento-Assuntos.dat. Pode envolver várias áreas do conhecimento.</li>
</ul>
</div>
</div>
<div id="outline-container-org8b4acdd" class="outline-3">
<h3 id="org8b4acdd"><span class="section-number-3">6.2.</span> Título do tema específico.</h3>
</div>
<div id="outline-container-org3e9f16d" class="outline-3">
<h3 id="org3e9f16d"><span class="section-number-3">6.3.</span> Título do sub-tema.</h3>
</div>
</div>
<div id="outline-container-orgabc8ad1" class="outline-2">
<h2 id="orgabc8ad1"><span class="section-number-2">7.</span> Descrição do desafio tecnológico</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>Coloque aqui uma breve descrição do desafio tecnológico.</li>
<li>Se necessário adicionar imagens e tabelas, referenciar artigos e livros, pode adicionar links para imagens e documentos externos.</li>
</ul>
</div>
</div>
<div id="outline-container-org112d553" class="outline-2">
<h2 id="org112d553"><span class="section-number-2">8.</span> Objetivo geral</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>Breve descrição do objetivo.</li>
<li>Nota: para as disciplina de modelagem computacional relacionar com modelos computacionais associados.</li>
</ul>
</div>
</div>
<div id="outline-container-org17cc12c" class="outline-2">
<h2 id="org17cc12c"><span class="section-number-2">9.</span> Solução esperada - Tipo</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li>Tipo do produto final, exemplo um software, um equipamento, uma metodologia.</li>
<li>Nota: para as disciplina de modelagem computacional o produto é sempre um software ou algoritmo.</li>
</ul>
</div>
</div>
<div id="outline-container-orgfe9d4c0" class="outline-2">
<h2 id="orgfe9d4c0"><span class="section-number-2">10.</span> Solução esperada - Descrição</h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li>Breve descrição do tipo de solução esperada.</li>
<li>Descreva o produto final esperado.</li>
</ul>
</div>
</div>
<div id="outline-container-org9697ee7" class="outline-2">
<h2 id="org9697ee7"><span class="section-number-2">11.</span> TRL pretendido</h2>
<div class="outline-text-2" id="text-11">
<ul class="org-ul">
<li>Veja conceito de TRL e material da disciplina <a href="https://sites.google.com/view/professorandreduartebueno/ensino/introdu%C3%A7%C3%A3o-ao-projeto-de-engenharia">Introdução ao Projeto de Engenharia</a>.</li>
</ul>
</div>
</div>
<div id="outline-container-orgf45aaaf" class="outline-2">
<h2 id="orgf45aaaf"><span class="section-number-2">12.</span> CRL pretendido</h2>
<div class="outline-text-2" id="text-12">
<ul class="org-ul">
<li>Veja conceito de CRL e material da disciplina <a href="https://sites.google.com/view/professorandreduartebueno/ensino/introdu%C3%A7%C3%A3o-ao-projeto-de-engenharia">Introdução ao Projeto de Engenharia</a>.</li>
</ul>
</div>
</div>
<div id="outline-container-org8ef3272" class="outline-2">
<h2 id="org8ef3272"><span class="section-number-2">13.</span> Informações básicas complementares</h2>
<div class="outline-text-2" id="text-13">
<ul class="org-ul">
<li>Coloque aqui um conjunto de informações que podem ajudar no entendimento do escopo do problema científico/tecnológico e do produto desejado.</li>
<li>Pode incluir links para material externo e referências bibliográficas.</li>
<li>Nota: No modelo disponibilizado no github temos dois diretórios para armazenar informações complementares.
<ul class="org-ul">
<li>MaterialAuxiliar: Material auxiliar ao projeto desenvolvido internamente.</li>
<li>MaterialExterno: Material auxiliar ao projeto desenvolvido por terceiros (adicionar lista de referências na bibliografia e citar autores).</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org259679e" class="outline-2">
<h2 id="org259679e"><span class="section-number-2">14.</span> Prazo máximo para desenvolvimento da solução</h2>
<div class="outline-text-2" id="text-14">
<ul class="org-ul">
<li>Varia de 18 a 36 meses.</li>
<li>O projeto de software é desenvolvido ao longo do 5/6/7 e eventualmente 8 períodos do curso.
Veja <a href="https://lh6.googleusercontent.com/1eHjd-GOlFhRpTXcye49LJDKAjjWcrxTuGjKC3_yDE0GL5_K5GD_eGxUVaDAxV_ALE50pX1yv_rJYPx3O5CeuV3FSvSxroPAoeJf3huomnRGfnRaR2UwunlQN2ki7qVY6Q=w1280">grade do curso</a>.</li>
<li>Se o projeto for extendido pode se transformar no TCC na forma de projeto de engenharia, nestes casos prever 6-12 meses a mais.</li>
<li>Nota: Note que é um projeto de longo prazo e que requer muita dedicação ao longo de todos os semestres envolvidos, não deixe para depois imaginando que terá condições de fazer "rápido¨, projetos de engenharia por definição são demorados.</li>
<li>Nota: Os modelos de software a serem desenvolvidos utilizam o paradigma da orientação a objetos, [1, 2, 3].</li>
</ul>
</div>
</div>

<div id="outline-container-org7bd6e0e" class="outline-2">
<h2 id="org7bd6e0e"><span class="section-number-2">15.</span> Bibliografia</h2>
<div class="outline-text-2" id="text-15">
<ol class="org-ol">
<li>Michael Blaha and James Rumbaugh, Modelagem e Projetos Baseados em Objetos com UML 2 (Rio de Janeiro: Campus, 2006).</li>
<li>André Duarte Bueno, Programação Orientada a Objeto com C++ - Aprenda a Programar em Ambiente Multiplataforma com Software Livre (São Paulo: Novatec, 2003).</li>
<li>James Rumbaugh, Michael Blaha, Wiliam Premerlani, Frederick Eddy, and William Lorensen, Modelagem e Projetos Baseados em Objetos (Rio de Janeiro: Edit. Campus, 1994).</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: André D. Bueno</p>
<p class="date">Created: 2023-12-23 sáb 20:08</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>